# Groupby

O método groupby permite agrupar linhas de dados em conjunto e chamar funções agregadas

In [24]:
import pandas as pd
# Cria um DataFrame
data = {'Classe':['Júnior','Júnior','Pleno','Pleno','Sênior','Sênior'],
       'Nome':['Jorge','Carlos','Roberta','Patrícia','Bruno','Vera'],
       'Venda':[200,120,340,124,243,350],
       'Empresa': ['FB', 'GOOG', 'FB', 'FB', 'MSFT', 'MSFT']}

In [25]:
df = pd.DataFrame(data)

In [26]:
df

   Classe      Nome  Venda Empresa
0  Júnior     Jorge    200      FB
1  Júnior    Carlos    120    GOOG
2   Pleno   Roberta    340      FB
3   Pleno  Patrícia    124      FB
4  Sênior     Bruno    243    MSFT
5  Sênior      Vera    350    MSFT

** Agora, você pode usar o método .group by () para agrupar as linhas em conjunto com base em um nome de coluna. Por exemplo, vamos agrupar com base na empresa. Isso criará um objeto DataFrameGroupBy:**

In [28]:
por_classe = df.groupby('Classe')

E, em seguida, chamar métodos agregados do objeto:

In [40]:
por_classe['Venda'].sum().reset_index()

   Classe  Venda
0  Júnior    320
1   Pleno    464
2  Sênior    593

In [46]:
por_nome = df.groupby('Nome')
por_nome['Venda'].mean()

Nome
Bruno       243.0
Carlos      120.0
Jorge       200.0
Patrícia    124.0
Roberta     340.0
Vera        350.0
Name: Venda, dtype: float64

In [47]:
por_nome.count()

          Classe  Venda  Empresa
Nome
Bruno          1      1        1
Carlos         1      1        1
Jorge          1      1        1
Patrícia       1      1        1
Roberta        1      1        1
Vera           1      1        1

Mais exemplos de métodos agregados:

In [49]:
por_nome['Venda'].std()

Nome
Bruno      NaN
Carlos     NaN
Jorge      NaN
Patrícia   NaN
Roberta    NaN
Vera       NaN
Name: Venda, dtype: float64

In [50]:
por_nome['Venda'].min()

Nome
Bruno       243
Carlos      120
Jorge       200
Patrícia    124
Roberta     340
Vera        350
Name: Venda, dtype: int64

In [51]:
por_nome['Venda'].max()

Nome
Bruno       243
Carlos      120
Jorge       200
Patrícia    124
Roberta     340
Vera        350
Name: Venda, dtype: int64

In [52]:
por_nome.describe()

         Venda
         count   mean std    min    25%    50%    75%    max
Nome
Bruno      1.0  243.0 NaN  243.0  243.0  243.0  243.0  243.0
Carlos     1.0  120.0 NaN  120.0  120.0  120.0  120.0  120.0
Jorge      1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
Patrícia   1.0  124.0 NaN  124.0  124.0  124.0  124.0  124.0
Roberta    1.0  340.0 NaN  340.0  340.0  340.0  340.0  340.0
Vera       1.0  350.0 NaN  350.0  350.0  350.0  350.0  350.0

In [53]:
por_nome.describe().transpose()

Nome         Bruno  Carlos  Jorge  Patrícia  Roberta   Vera
Venda count    1.0     1.0    1.0       1.0      1.0    1.0
      mean   243.0   120.0  200.0     124.0    340.0  350.0
      std      NaN     NaN    NaN       NaN      NaN    NaN
      min    243.0   120.0  200.0     124.0    340.0  350.0
      25%    243.0   120.0  200.0     124.0    340.0  350.0
      50%    243.0   120.0  200.0     124.0    340.0  350.0
      75%    243.0   120.0  200.0     124.0    340.0  350.0
      max    243.0   120.0  200.0     124.0    340.0  350.0

In [55]:
por_nome.describe().transpose()['Bruno']

Venda  count      1.0
       mean     243.0
       std        NaN
       min      243.0
       25%      243.0
       50%      243.0
       75%      243.0
       max      243.0
Name: Bruno, dtype: float64